class DBManager:
    get_companies_and_vacancies_count()
    """ — получает список всех компаний и количество вакансий у каждой компании."""
    pass


    get_all_vacancies()
    """— получает список всех вакансий с указанием названия компании, названия вакансии и зарплаты и ссылки на вакансию."""
    pass


    get_avg_salary()
    """ — получает среднюю зарплату по вакансиям."""
    pass


    get_vacancies_with_higher_salary()
    """— получает список всех вакансий, у которых зарплата выше средней по всем вакансиям."""
    pass


    get_vacancies_with_keyword()
    """— получает список всех вакансий, в названии которых содержатся переданные в метод слова, например python."""
    pass